In [21]:
import pandas as pd
l=[1,2,3,4,5,6]
var=pd.DataFrame(l)
print(var)

   0
0  1
1  2
2  3
3  4
4  5
5  6

                                                        Dicionary Dataframe

In [9]:
dic={
    "a":["waris","Numan","Ali","Zafar"],
    "b":["reema","Risha","raniii","rore"],
    "c":["waris-abbasi","Numan-khan","Ali-shah","Zafar-abbasi"],
    "d":["mahira khan","malika arora","seemab-zafar","reema-shah"]
}

var2=pd.DataFrame(dic)
print(type(var2))
var2

<class 'pandas.core.frame.DataFrame'>

       a       b             c             d
0  waris   reema  waris-abbasi   mahira khan
1  Numan   Risha    Numan-khan  malika arora
2    Ali  raniii      Ali-shah  seemab-zafar
3  Zafar    rore  Zafar-abbasi    reema-shah

                                                Aceeesing a key from the dictionary

In [19]:
print(var2["b"][0])
print(var2["b"][1])
print(var2["b"][2])
print(var2["b"][3])

reema
Risha
raniii
rore

                                                                List with in  List

In [28]:
listWithlist=[[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]]
var3=pd.DataFrame(listWithlist)
print("The colum 0 at index 2:",var3[0][2])
print("The colum 1 at index 2:",var3[1][2])
print("The colum 2 at index 2:",var3[2][2])
print("The colum 3 at index 2:",var3[3][2])
print("The colum 4 at index 2:",var3[4][2])
var3

The colum 0 at index 2: 11
The colum 1 at index 2: 12
The colum 2 at index 2: 13
The colum 3 at index 2: 14
The colum 4 at index 2: 15

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20

                                                If we want to acess specific colum from the list

In [35]:
dic={
    "a":["waris","Numan","Ali","Zafar"],
    "b":["reema","Risha","raniii","rore"],
    "c":["waris-abbasi","Numan-khan","Ali-shah","Zafar-abbasi"],
    "d":["mahira khan","malika arora","seemab-zafar","reema-shah"]
}

var2=pd.DataFrame(dic,columns=["a","d"])
print(type(var2))
var2

<class 'pandas.core.frame.DataFrame'>

       a             d
0  waris   mahira khan
1  Numan  malika arora
2    Ali  seemab-zafar
3  Zafar    reema-shah

                                                if we want to change index

In [39]:
dic={
    "a":["waris","Numan","Qasim","Tabii"],
    "b":["reema","Risha","raniii","rore"],
    "c":["waris-abbasi","Numan-khan","Ali-shah","Zafar-abbasi"],
    "d":["mahira khan","malika arora","seemab-zafar","reema-shah"]
}

var2=pd.DataFrame(dic,index=["a","s","d","f"])
print(type(var2))
var2

<class 'pandas.core.frame.DataFrame'>

       a       b             c             d
a  waris   reema  waris-abbasi   mahira khan
s  Numan   Risha    Numan-khan  malika arora
d  Qasim  raniii      Ali-shah  seemab-zafar
f  Tabii    rore  Zafar-abbasi    reema-shah

                                                        Dataframe from the two diffrent series

In [37]:
l=[pd.Series([1,2,3,4,5,6]),pd.Series([7,8,9,10,11,12])]
var4=pd.DataFrame(l)
var4

   0  1  2   3   4   5
0  1  2  3   4   5   6
1  7  8  9  10  11  12